БухЭксп/Documents/CW_ДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ДвижениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоПриобретениям</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВСоставеРасходовПоПриобретениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперацийДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщикуПоПриобретениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ДвижениеДенежныхСредств/Forms/ФормаПрочиеВидыОпераций/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);

	ВедениеБухгалтескогоУчетаМСФО = ПолучитьФункциональнуюОпцию("CW_ВедениеБухгалтескогоУчетаМСФО");
	
	Если ВедениеБухгалтескогоУчетаМСФО Тогда
		ИмяНастроек 		= "Настойки_CW_ОперацииМСФО";
		СтруктураНастройки 	= Обработки.CW_ОперацииМСФО.ПолучитьНастройки(ИмяНастроек);
		НастройкиМСФО.Добавить(СтруктураНастройки);
	КонецЕсли;
		
	_ОбновитьИтоги();
	_УправлениеЭлементамиФормы();
	_СформироватьЗаголовок();
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу
	
	_УстановитьОтборДоговора();
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если Не ЭтаФорма.ТолькоПросмотр тогда
		ЭтаФорма.ТолькоПросмотр = Не CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация 		= CW_Настройки.ОсновнаяОрганизация();
	Конецесли;
	
	#Область МСФО_Модуль
	СчетПриИзмененииНаСервере();
	УстановитьВидимостьНДС();
	УчитыватьНДСПриИзмененииНаСервере();
	#КонецОбласти
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	//Если (Объект.ВидОперации.Пустая()) Тогда
	//	
	//	ВыбратьВидОперации();
	//	
	//КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу

	//_УправлениеЭлементамиФормы();	
	_СформироватьЗаголовок();
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

//&НаКлиенте
//Процедура ВыбратьВидОперации()
//	// --- 
//	
//	Список = _СписокВидовОпераций();
//	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВидаОперации",ЭтотОбъект); 
//	Список.ПоказатьВыборЭлемента(ПОВ,"Вид операции");
//	
//	// --- 
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораВидаОперации(Ответ, ДополнительныеПараметры) Экспорт
//	// --- 
//	
//	Если (Ответ <> Неопределено) Тогда
//		
//		Объект.ВидОперации = Ответ.Значение;
//		_ВидОперацииПриИзменении();
//		
//	КонецЕсли; 
//	
//	// --- 
//КонецПроцедуры
  

&НаСервере
Функция _УправлениеЭлементамиФормы()
	// --- 
	
	Если (Объект.ВидОперации.Пустая()) Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	
	// ---------------------------------------------------------------------------- 
	
	ВалютаКассы = Объект.Касса.Валюта;
	ЗаполненаВалютаКассы = ЗначениеЗаполнено(ВалютаКассы);
	Элементы.СуммаВК.Доступность = (ЗаполненаВалютаКассы);
	Элементы.СуммаВК.Заголовок = "Сумма";
	Если (ЗаполненаВалютаКассы) Тогда
		_сф.стр_Добавить(Элементы.СуммаВК.Заголовок,", "+Строка(ВалютаКассы));
	КонецЕсли; 
	Элементы.РасшифровкаСуммаВК.Заголовок = Элементы.СуммаВК.Заголовок;
	// --- 
	ВалютаДоговора = Объект.Договор.ВалютаДоговора;
	ЗаполненаВалютаДоговора = ЗначениеЗаполнено(ВалютаДоговора);
	Элементы.СуммаВД.Доступность = (ЗаполненаВалютаДоговора);
	Элементы.СуммаВД.Заголовок = "Сумма";
	Если (ЗаполненаВалютаДоговора) Тогда
		_сф.стр_Добавить(Элементы.СуммаВД.Заголовок,", "+Строка(ВалютаДоговора));
	КонецЕсли;
	Элементы.РасшифровкаСуммаВД.Заголовок = Элементы.СуммаВД.Заголовок;
	
	// --- 
	
	ВалютаКассыПоступления = Объект.КассаПоступления.Валюта;
	ЗаполненаВалютаКассыПоступления = ЗначениеЗаполнено(ВалютаКассыПоступления);
	Элементы.СуммаПоступления.Доступность = (ЗаполненаВалютаКассыПоступления);
	Элементы.СуммаПоступления.Заголовок = "Сумма";
	Если (ЗаполненаВалютаКассыПоступления) Тогда
		_сф.стр_Добавить(Элементы.СуммаПоступления.Заголовок,", "+Строка(ВалютаКассыПоступления));
	КонецЕсли;
	
	
	
	Если Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя
		ИЛИ Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику
		ИЛИ Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям Тогда
		
		Элементы.ГруппаДенежныеСредства.Высота=0;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.ГруппаКассаПоступления.Видимость = Ложь;
		Элементы.СуммаВК.ТолькоПросмотр=Истина;
		Элементы.СуммаВД.ТолькоПросмотр=Истина;
		//Элементы.ГруппаНазначениеПлатежа.Видимость = Истина;
		Элементы.СтраницаРасшифровка.Видимость = Истина;
		
		Если (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя) Тогда
			
			Элементы.ГруппаКонтрагент.Заголовок = "Покупатель";
			
		КонецЕсли; 
		
		Если Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику 
			ИЛИ Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям Тогда
			
			Элементы.ГруппаКонтрагент.Заголовок = "Поставщик"; 
			
		КонецЕсли; 
		
		Элементы.СуммаВД.Видимость = Ложь;
		Элементы.РасшифровкаСуммаВД.Видимость = Ложь;
		Если (ЗаполненаВалютаКассы И ЗаполненаВалютаДоговора И ВалютаКассы <>  ВалютаДоговора ) Тогда
			
			Элементы.СуммаВД.Видимость = Истина;
			Элементы.РасшифровкаСуммаВД.Видимость = Истина;
			
		КонецЕсли; 
		
		//Модуль_МСФО
		Элементы.СтраницаМСФО.Видимость = Ложь;
		//Модуль_МСФО
		
	ИначеЕсли (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПрочиеПоступления
		ИЛИ Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПрочиеСписания) Тогда 
		
		Элементы.ГруппаДенежныеСредства.Высота=8;
		Элементы.ГруппаКонтрагент.Видимость = Ложь;
		Элементы.ГруппаКассаПоступления.Видимость = Ложь;
		Элементы.СуммаВК.ТолькоПросмотр=Ложь;
		Элементы.СуммаВД.ТолькоПросмотр=Ложь;
		//Элементы.ГруппаНазначениеПлатежа.Видимость = Истина;
		Элементы.СтраницаРасшифровка.Видимость = Ложь;
		
		//Модуль_МСФО
		Элементы.СтраницаМСФО.Видимость = ВедениеБухгалтескогоУчетаМСФО;
		//Модуль_МСФО
		
	ИначеЕсли (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу) Тогда 
		
		Элементы.ГруппаДенежныеСредства.Высота=0;		
		Элементы.ГруппаКонтрагент.Видимость = Ложь;
		Элементы.ГруппаКассаПоступления.Видимость = Истина;
		Элементы.СуммаВК.ТолькоПросмотр=Ложь;
		Элементы.СуммаВД.ТолькоПросмотр=Ложь;
		//Элементы.ГруппаНазначениеПлатежа.Видимость = Истина;
		Элементы.СтраницаРасшифровка.Видимость = Ложь;
		// --- 
		Элементы.ГруппаДенежныеСредства.Заголовок = "Списание";
		Элементы.ГруппаКассаПоступления.Заголовок = "Поступление";
		
		// --- 
		Элементы.СуммаПоступления.Видимость 			= (ЗначениеЗаполнено(Объект.Касса.Валюта) И ЗначениеЗаполнено(Объект.КассаПоступления.Валюта) И Объект.Касса.Валюта <> Объект.КассаПоступления.Валюта);
		Элементы.РассчитатьСуммуПоступления.Видимость 	= (ЗначениеЗаполнено(Объект.Касса.Валюта) И ЗначениеЗаполнено(Объект.КассаПоступления.Валюта) И Объект.Касса.Валюта <> Объект.КассаПоступления.Валюта);
		
		//Модуль_МСФО
		Элементы.СтраницаМСФО.Видимость = Ложь;
		//Модуль_МСФО
		
	КонецЕсли; 
	
	Элементы.РасшифровкаПодборДокументов.Доступность = (ЗначениеЗаполнено(Объект.Касса.Валюта) И ЗначениеЗаполнено(Объект.Договор));
	
	//_СформироватьЗаголовок();
	
	// --- 
КонецФункции

&НаСервере
Функция _ОбновитьИтоги()
	// --- 
	
	ИтогоСуммаВК = Объект.Расшифровка.Итог("СуммаВК");
	ИтогоСуммаВД = Объект.Расшифровка.Итог("СуммаВД");
	
	ТекстЗаголовка = "Документы";
	КоличествоСтрок = Объект.Расшифровка.Количество();
	Элементы.СтраницаРасшифровка.Заголовок = ТекстЗаголовка+" ("+Формат(КоличествоСтрок,"ЧЦ=5; ЧДЦ=0; ЧН=; ЧГ=")+")";
	
	Итого = "Оплачено: ";
	Если (КоличествоСтрок = 0) Тогда
		Итого = Итого+"Нет данных";
	Иначе
		
		Если (Элементы.СуммаВД.Видимость) Тогда
			
			_сф.стр_Добавить(Итого,Формат(ИтогоСуммаВД,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Договор.ВалютаДоговора)+", ");
			
		КонецЕсли; 
		_сф.стр_Добавить(Итого,Формат(ИтогоСуммаВК,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Касса.Валюта));
		
	КонецЕсли; 
		
	// --- 
КонецФункции
 

&НаСервере
Функция _СформироватьЗаголовок()
	
	ЗаголовокДокумента = 
			"Движение денежных средств" + " " 
			+ ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+нрег(Объект.ВидОперации)+")", "")
			+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

//&НаСервере
//Функция _ВидОперацииПриИзменении()
//	// --- 
//	
//	Если (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику ИЛИ
//		Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя) Тогда
//		
//		Если (НЕ ЗначениеЗаполнено(Объект.Организация)) Тогда
//			
//			ОсновнаяОрганизация = CW_Настройки.ОсновнаяОрганизация();
//			Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
//				Объект.Организация = ОсновнаяОрганизация;	
//			КонецЕсли;
//			
//		КонецЕсли; 
//		
//	КонецЕсли; 
//	
//	_УстановитьОтборДоговора();
//	
//	Объект.Контрагент = Неопределено;
//	Объект.Договор = Неопределено;
//	Объект.СуммаВД = 0;
//	Объект.СуммаВК = 0;
//	// --- 
//	Объект.КассаПоступления = Неопределено;
//	Объект.ПоступлениеСтатьяДДС=Неопределено;
//	// --- 
//	Объект.Расшифровка.Очистить();
//	// --- 
//	_ОбновитьИтоги();
//	_УправлениеЭлементамиФормы();
//	_СформироватьЗаголовок();
//	
//	// --- 
//КонецФункции

&НаСервере
Функция _УстановитьОтборДоговора()
	
	мПараметрыВыбора = Новый Массив;
	
	Если Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику Тогда
		
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
		
		ФиксированныйМассив = Новый ФиксированныйМассив(МассивЗначений);
		
		мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ФиксированныйМассив));
		
	ИначеЕсли Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя Тогда
		
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
		
		ФиксированныйМассив = Новый ФиксированныйМассив(МассивЗначений);
		
		мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ФиксированныйМассив));
		
	ИначеЕсли Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям Тогда
		
		мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее")));
		
	КонецЕсли; 
	
	Элементы.Договор.ПараметрыВыбора =  Новый ФиксированныйМассив(мПараметрыВыбора);

КонецФункции
 

&НаСервере
Функция _СписокВидовОпераций()
	
	МассивИсключамыхИмен = Новый Массив; 
	
	//Для операций "Возврат покупателю" и "Возврат поставщику" используются отдельная форма документа
	МассивИсключамыхИмен.Добавить("ВозвратПокупателю");
	МассивИсключамыхИмен.Добавить("ВозвратОтПоставщика");   
	
	Если Не ВедениеБухгалтескогоУчетаМСФО Тогда
		МассивИсключамыхИмен.Добавить("ОплатаПоставщикуПоПриобретениям");
	КонецЕсли;
	
	СписокОпераций = Новый СписокЗначений;
	Для каждого СтрЗначение Из Метаданные.Перечисления.CW_ВидыОперацийДДС.ЗначенияПеречисления Цикл
		Если МассивИсключамыхИмен.Найти(СтрЗначение.Имя) = Неопределено  Тогда
			СписокОпераций.Добавить(Перечисления.CW_ВидыОперацийДДС[СтрЗначение.Имя],СтрЗначение.Синоним);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат СписокОпераций;
	
КонецФункции
 

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	_ПроверитьДоговор();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	_ПроверитьДоговор();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьДоговор()
	// --- 
	
	Если (ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация) И НЕ ЗначениеЗаполнено(Объект.Договор)) Тогда
		
		Если (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщику) Тогда
			
			Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			
		ИначеЕсли (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя) Тогда 
			
			Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем); 
			
		ИначеЕсли (Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям) Тогда 
			
			Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.Прочее); 
			
		КонецЕсли; 
		
		ДоговорПриИзмененииНаСервере();
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();  
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.Валюта = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДОговора(Объект.ПриложениеКДоговору, Объект.Договор);
	
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПодборДокументов(Команда)
	
	// касса и договор должны быть уже выбраны!
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбораДокументов",ЭтотОбъект); 
	ПФ = _ПараметрыФормыПодбора();
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПодбораСчетовДляОплаты",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораДокументов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		_ОбработатьПодборДокументов(Ответ);
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПараметрыФормыПодбора()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата",				?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата));
	СтруктураПараметров.Вставить("ВидОперации", 		Объект.ВидОперации);
	СтруктураПараметров.Вставить("Организация", 		Объект.Организация);
	СтруктураПараметров.Вставить("Контрагент", 			Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор", 			Объект.Договор);
	СтруктураПараметров.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	СтруктураПараметров.Вставить("СтатьяДДС", 			Объект.СтатьяДДС);
	
	СтруктураПараметров.Вставить("РежимДДС",			Истина);
	СтруктураПараметров.Вставить("ВедомыйДокумент",		Неопределено);
	СтруктураПараметров.Вставить("ВалютаДокумента",		Объект.Валюта);
	СтруктураПараметров.Вставить("Валюта",				Объект.Валюта);
	СтруктураПараметров.Вставить("ВалютаКассы",			Объект.Касса.Валюта);
	СтруктураПараметров.Вставить("Представление",		Объект.ПредставлениеДокумента);
	СтруктураПараметров.Вставить("АдресТаблицыОЗ",		ПоместитьВоВременноеХранилище(Объект.Расшифровка.Выгрузить(),ЭтаФорма.УникальныйИдентификатор));
	
	Возврат СтруктураПараметров;

КонецФункции
 
&НаСервере
Функция _ОбработатьПодборДокументов(Ответ)
	// --- 
	
	Объект.Расшифровка.Загрузить(ПолучитьИзВременногоХранилища(Ответ.АдресТаблицыДокумента));
	Объект.СуммаВД = Объект.Расшифровка.Итог("СуммаВД");
	Объект.СуммаВК = Объект.Расшифровка.Итог("СуммаВК");
	// --- 
	_ОбновитьИтоги();
	
	// --- 
КонецФункции

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	_СформироватьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	_СформироватьЗаголовок();
	
КонецПроцедуры

//&НаКлиенте
//Процедура СменаВидаОперации(Команда)
//	
//	ВыбратьВидОперации();
//	
//КонецПроцедуры

&НаКлиенте
Процедура КассаПоступленияПриИзменении(Элемент)
	
	РассчитатьСуммуПоступленияНаСервере();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	
	Объект.Расшифровка.Очистить();
	_ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	
	_СтатьяДДСПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция _СтатьяДДСПриИзменении()
	// --- 
	
	Если (Объект.ВидОперации <> Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу) Тогда
		
		Если (НЕ ЗначениеЗаполнено(Объект.НазначениеПлатежа)) Тогда
			
			Объект.НазначениеПлатежа = Строка(Объект.СтатьяДДС);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	_ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
	
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти 


#Область МСФО_Модуль

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	СчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииНаСервере()
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
	ЭтотОбъект, ЭтотОбъект.Объект, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
	УстановитьВидимостьКоличества();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоличества()
	
	Элементы.Количество.Видимость = Объект.Счет.Количественный; 
	
КонецПроцедуры

&НаСервере
Функция ПараметрыУстановкиСвойствСубконто(Форма, Постфикс = "") Экспорт
	
	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"Субконто"  	+ Постфикс,
		"Подразделение" + Постфикс,
		"Субконто",
		"Подразделение",
		"Счет");
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСубконто(Форма, НомерСубконто)
	
	тОбъект = Форма.Объект;
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(
		Форма, тОбъект, НомерСубконто, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка)

	
	тОбъект = Форма.Объект;
	
	ДанныеОбъекта = CW_БухгалтерскийУчетКлиентСерверМСФО.ДанныеУстановкиПараметровСубконто(
		тОбъект, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере()
	Возврат  ПараметрыУстановкиСвойствСубконто(ЭтотОбъект, "");
КонецФункции

&НаКлиенте
Процедура РассчитатьНДС(Команда)
	РассчитатьНДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьНДСНаСервере()
	
	ТекСтавкаНДС  	= CW_Финансы.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	ЦенаСНДС 		= Объект.СуммаВК;
	Объект.СуммаНДС	= Окр(ЦенаСНДС /(100+ТекСтавкаНДС)*ТекСтавкаНДС, 2, 1);
	
КонецПроцедуры

&НаСервере
Процедура УчитыватьНДСПриИзмененииНаСервере()
	
	Элементы.ГруппаУчетНДС.Видимость = Объект.УчитыватьНДС;
	
	Если Объект.УчитыватьНДС Тогда
		//Заполняем счета МСФО
		Если НастройкиМСФО.Количество() > 0 Тогда
			ЭлементСписка 		= НастройкиМСФО.Получить(0);
			СтруктураНастроек 	= ЭлементСписка.Значение;
			
			Если Не ЗначениеЗаполнено(Объект.СчетНДС) и СтруктураНастроек.Свойство("СчетУчетаНДС") Тогда
				Объект.СчетНДС = СтруктураНастроек.СчетУчетаНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	УчитыватьНДСПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СтавкаНДСПриИзмененииНаСервере()
	РассчитатьНДСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	СтавкаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьВСоставеРасходовПоПриобретениямПриИзмененииНаСервере()
	УстановитьВидимостьНДС();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНДС()
	
	Элементы.ГруппаНДСМСФО.Видимость = Объект.ОтразитьВСоставеРасходовПоПриобретениям;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВСоставеРасходовПоПриобретениямПриИзменении(Элемент)
	ОтразитьВСоставеРасходовПоПриобретениямПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуПоступления(Команда)
	РассчитатьСуммуПоступленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуПоступленияНаСервере()
	
	ВалютаКассыСписания 	= Объект.Касса.Валюта;
	ВалютаКассыПоступления 	= Объект.КассаПоступления.Валюта;
	
	ДатаКурса	 					= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	СтруктураКурсаКассы 			= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассыСписания,ДатаКурса);
	СтруктураКурсаКассыПоступления 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассыПоступления,ДатаКурса);
	
	Объект.СуммаВД = CW_Финансы.ПересчитатьИзВалютыВВалюту(Объект.СуммаВК, ВалютаКассыСписания, ВалютаКассыПоступления,СтруктураКурсаКассы.Курс, СтруктураКурсаКассыПоступления.Курс,СтруктураКурсаКассы.Кратность, СтруктураКурсаКассыПоступления.Кратность);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

//Взаиморасчеты по документу
&НаКлиенте
Процедура Команда_ВзаиморасчетыПоДокументу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда   
		Возврат;
	КонецЕсли;   
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ПоступлениеОтПокупателя") Тогда
		ВидЗадолженности ="ДЕБИТОРСКАЯ";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ОплатаПоставщику") Тогда
		ВидЗадолженности ="КРЕДИТОРСКАЯ";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям") Тогда
		ВидЗадолженности ="КРЕДИТОРСКАЯ";
	КонеЦЕсли;	
	
	CW_ВзаиморасчетыПоДокументуКлиент.ОткрытьФормуОтчетаВзаиморасчетыПоДокументу(ЭтаФорма, Объект.Ссылка, ВидЗадолженности);
	
КонецПроцедуры
//Взаиморасчеты по документу
